{
  "backend/main.mo": "Motoko canister managing user profiles and CV data with access control, blob storage, and CRUD functions for profiles, CVs, and photos.",
  "feature_evidence.json": "Feature evidence mapping showing which frontend files and components support recent CV preview redesign and print-style refinements.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of key frontend components, hooks, configuration, and styling files.",
  "frontend/index.css": "Base and component-level Tailwind layers defining OKLCH color variables, dark mode tokens, and global styling utilities.",
  "frontend/index.html": "Root HTML document that loads the React application via main.tsx and mounts it in the #root element.",
  "frontend/src/App.tsx": "Main React component that handles authentication state, profile‑setup flow, and routing between login and CV builder pages.",
  "frontend/src/components/auth/AuthStatus.tsx": "Header dropdown showing authenticated user info, initials avatar, and sign‑out action with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal forcing new authenticated users to enter a profile name, submitting it via mutation with validation and toast feedback.",
  "frontend/src/components/cv/CVForm.tsx": "Comprehensive CV form handling personal details, photo upload, summary text, repeatable sections, and skill chip management.",
  "frontend/src/components/cv/CVPreview.tsx": "Renders a full CV preview card using form data, showing photo, contact info, summary, and structured sections like work experience and education.",
  "frontend/src/components/cv/PhotoUploader.tsx": "Provides image upload with validation, progress tracking, preview, and removal controls for a CV photo.",
  "frontend/src/components/cv/RepeatableListEditor.tsx": "Generic component for editing repeatable item lists with add, update, and remove functionality.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useCVData.ts": "React Query hooks for fetching, saving, and clearing CV data via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, identity loading, and state management.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for retrieving and updating the caller's user profile using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and detailed custom styles for CV preview layout, typography, and theming.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/CVBuilderPage.tsx": "Renders the CV builder, loads saved CV data, manages form state, and saves serialized CV entries to the backend.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen with Internet Identity authentication and feature highlights.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for extracting, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Describes the project state, existing features, requirements, and pending feature requests."
}