{
  "backend/main.mo": "Defines a canister with access-controlled user profile and CV management, including CRUD operations and photo upload using ExternalBlob storage.",
  "feature_evidence.json": "Lists feature-to-file mappings, components, and test coverage for implemented authentication and CV builder features.",
  "frontend-file-summaries.txt": "Contains prewritten one-line summaries for key frontend files used in authentication, CV editing, previewing, and styling.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based color variables for light and dark themes with base styling.",
  "frontend/index.html": "Basic HTML entry point defining the root element and loading the main React script.",
  "frontend/src/App.tsx": "Top-level app component handling authentication state, conditional routing, and profile setup modal display.",
  "frontend/src/components/auth/AuthStatus.tsx": "Header dropdown showing authenticated user's name and initials with logout functionality.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time users to enter and save their display name with validation and loading states.",
  "frontend/src/components/cv/CVForm.tsx": "Main CV form component collecting personal details, photo, summary, experience, and skills with editable sections.",
  "frontend/src/components/cv/CVPreview.tsx": "Renders a styled CV preview card showing photo, contact info, summary, work experience, and education from form data.",
  "frontend/src/components/cv/PhotoUploader.tsx": "Handles image upload with validation, progress tracking, preview display, and removal for profile photos.",
  "frontend/src/components/cv/RepeatableListEditor.tsx": "Reusable editor for adding, updating, and removing list items using custom render logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, invalidating related queries on change.",
  "frontend/src/hooks/useCVData.ts": "Provides hooks to fetch, save, and clear CV data using the backend actor with React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and updating the caller's user profile through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, theming, and print-specific rules for CV output.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering the main component.",
  "frontend/src/pages/CVBuilderPage.tsx": "Page component that loads, edits, and saves user CV data, mapping backend fields to form state and providing preview, validation, and print functionality.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login screen using Internet Identity with a sign‑in button and feature highlights.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and theme settings with custom plugins.",
  "project_state.json": "Metadata describing current project features, requirements, and pending feature requests for the CV maker app."
}