{
  "kind": "build_request",
  "title": "Modernize and professionalize the CV preview design",
  "projectName": "Pro CV Maker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Redesign the CV preview template to look more professional and modern while keeping all existing CV fields and real-time updates intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Bhai make the cv design more professional and modern"
        ]
      },
      "acceptanceCriteria": [
        "The CV preview (frontend/src/components/cv/CVPreview.tsx) uses a more modern, resume-like layout (improved typography hierarchy, spacing, alignment, and section styling) without removing any existing sections/fields currently shown.",
        "The header area (name, photo, contact details) looks visually balanced and professional (e.g., cleaner alignment, consistent icon sizing, refined photo framing).",
        "Section headers and dividers look modern (e.g., subtle separators, consistent section spacing) and remain readable when printed.",
        "Skills rendering looks more polished than the current gray badges (e.g., refined pill style, spacing, wrapping) while remaining print-friendly.",
        "All preview content remains black-on-white or otherwise highly legible and continues to print/export cleanly via the existing browser print flow."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Refine print-specific styling for the CV preview so the new modern design renders consistently when users click “Print / Save as PDF”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make the cv design more professional and modern"
        ]
      },
      "acceptanceCriteria": [
        "Print output does not show app chrome (form/header/footer already hidden) and the CV preview fills the page cleanly with consistent margins and spacing.",
        "No new background colors/effects reduce legibility in print; text remains crisp and high-contrast.",
        "The updated preview avoids awkward page breaks where possible (headings and grouped blocks do not separate in unnatural ways)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (Shadcn components must be composed, not edited).",
    "Do not edit frontend immutable paths listed in SYSTEM_CONTEXT (e.g., auth hooks and bootstrap files).",
    "Do not change backend canister APIs or persisted CV data format as part of this design refresh."
  ],
  "nonGoals": [
    "Adding new CV sections/fields or changing the CV data model/serialization.",
    "Changing authentication, save/load behavior, or the print/export mechanism beyond styling improvements.",
    "Introducing new third-party UI libraries beyond what is already in the project."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}