{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Pro CV Maker — Modern CV preview redesign + print refinement",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Redesign the CV preview to a more modern, professional resume layout while preserving all existing fields and real-time updates.",
      "acceptanceCriteria": [
        "The CV preview (frontend/src/components/cv/CVPreview.tsx) uses a more modern, resume-like layout (improved typography hierarchy, spacing, alignment, and section styling) without removing any existing sections/fields currently shown.",
        "The header area (name, photo, contact details) looks visually balanced and professional (e.g., cleaner alignment, consistent icon sizing, refined photo framing).",
        "Section headers and dividers look modern (e.g., subtle separators, consistent section spacing) and remain readable when printed.",
        "Skills rendering looks more polished than the current gray badges (e.g., refined pill style, spacing, wrapping) while remaining print-friendly.",
        "All preview content remains black-on-white or otherwise highly legible and continues to print/export cleanly via the existing browser print flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cv/CVPreview.tsx",
          "operation": "modify",
          "description": "Update the CVPreview layout and styling to a more modern resume look (typography hierarchy, spacing rhythm, header composition, section structure) while keeping all existing sections/fields and live-updating behavior. Use shadcn-ui components (Card, Separator, Badge) to compose the layout without editing anything under frontend/src/components/ui; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust CV preview-specific utility classes (scoped to .cv-preview and related classnames used by CVPreview) to support consistent, professional spacing/alignment, modern separators, refined photo framing, and print-friendly polished skill pills while preserving high-contrast legibility."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Refine print-specific styling so the updated modern CV preview prints consistently and avoids awkward breaks.",
      "acceptanceCriteria": [
        "Print output does not show app chrome (form/header/footer already hidden) and the CV preview fills the page cleanly with consistent margins and spacing.",
        "No new background colors/effects reduce legibility in print; text remains crisp and high-contrast.",
        "The updated preview avoids awkward page breaks where possible (headings and grouped blocks do not separate in unnatural ways)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Enhance @media print rules for the CV preview to ensure consistent page fill/margins, crisp high-contrast output, and improved page-break behavior (keep headings with following content, avoid breaking key grouped blocks), while keeping the existing browser print flow unchanged."
        },
        {
          "path": "frontend/src/pages/CVBuilderPage.tsx",
          "operation": "modify",
          "description": "Adjust layout classnames for print so the preview column behaves as a single, full-width document on print (e.g., neutralize sticky/two-column grid behavior for print) while keeping the on-screen builder layout unchanged."
        }
      ]
    }
  ]
}